[
  {
    "id": 1,
    "imageUrl": "https://m.media-amazon.com/images/I/A11Akqz5F9L._AC_UF1000,1000_QL80_.jpg",
    "title": "Pinocchio",
    "author": "Carlo Collodi",
    "year": "1883",
    "tags": [
      "Fantasy"
    ],
    "description": "Pinocchio is a cultural icon and one of the most reimagined characters in children's literature. His story has been adapted into many other media, notably the 1940 Disney film Pinocchio.[5] Collodi often used the Italian Tuscan dialect in his book. The name Pinocchio is possibly derived from the rare Tuscan form pinocchio (“pine nut”) or constructed from pino (“pine tree, pine wood”) and occhio (“eye”).",
    "reviewStar": "2",
    "isComplete": false
  },
  {
    "id": 2,
    "imageUrl": "https://m.media-amazon.com/images/I/61qLFlgZ5gL._AC_UF894,1000_QL80_.jpg",
    "title": "Clean Code",
    "author": "Rober C. Martin",
    "year": "2008",
    "tags": [
      "Programming",
      "Algorithm"
    ],
    "description": "Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer",
    "reviewStar": "5",
    "isComplete": true
  },
  {
    "id": 3,
    "imageUrl": "https://m.media-amazon.com/images/I/91hJe52QzjL._AC_UF1000,1000_QL80_.jpg",
    "title": "Sherlock Holmes",
    "author": "Arthur Conan Doyle",
    "year": 1229,
    "tags": [
      "Mystery",
      "Physchology"
    ],
    "description": "Sherlock Holmes is a fictional detective created by British author Arthur Conan Doyle. Referring to himself as a 'consulting detective' in the stories, Holmes is known for his proficiency with observation, deduction, forensic science and logical reasoning that borders on the fantastic, which he employs when investigating cases for a wide variety of clients, including Scotland Yard.",
    "reviewStar": 4,
    "isComplete": false
  }
]